// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. Через строку решать нельзя.

// 456 -> 5
// 782 -> 8
// 918 -> 1

Console.Write("Введите трехзначное число: ");
int num = Convert.ToInt32(Console.ReadLine());

if (num > 99 && num < 1000)
{
    int res = num / 10;
    num = res % 10;
    Console.WriteLine($"Второе число - {num}");
}
else Console.WriteLine($"Число {num} не является трехзначным!!!");